of90/tutorials/rheoFoam/CrossSlot/Oldroyd-BLog/0/theta
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volSymmTensorField;
    object      theta;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform (0 0 0 0 0 0);

boundaryField
{

    inlet_north
    {
        type            fixedValue;
        value           uniform (0 0 0 0 0 0);
    }
    inlet_south
    {
        type            fixedValue;
        value           uniform (0 0 0 0 0 0);
    }
    walls
    {     
        type            zeroGradient;
    }  
    outlet_west
    {
         type           zeroGradient;
    }
    outlet_east
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }

}

// ************************************************************************* //
